{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-Dataset",
    "1": "B-Key_Finding",
    "2": "B-Methodology",
    "3": "B-Tool_Library",
    "4": "I-Dataset",
    "5": "I-Key_Finding",
    "6": "I-Methodology",
    "7": "I-Tool_Library",
    "8": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-Dataset": 0,
    "B-Key_Finding": 1,
    "B-Methodology": 2,
    "B-Tool_Library": 3,
    "I-Dataset": 4,
    "I-Key_Finding": 5,
    "I-Methodology": 6,
    "I-Tool_Library": 7,
    "O": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.56.2",
  "vocab_size": 30522
}
